# Flip Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveLoop..::..Flip Method
CurveLoop Class See Also
---
Reverses the orientation of the curve loop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void Flip()
```

Visual Basic
---
```text
Public Sub Flip
```

Visual C++
---
```text
public:
void Flip()
```

# See Also
CurveLoop Class
Autodesk.Revit.DB Namespace